# Задача 1. Котешка диета
# За да са здрави котките, храненето им трябва да следва определена диета. Напишете програма, която изчислява котешкото процентно разпределение на макроелементите в храната за един ден и пресмята колко средно калории дава един грам от тази храна. Макроелементите са: мазнини, протеини и въглехидрати.
# Разполагате с общия брой калории, които котката трябва да приеме за един ден.
# Известно е, че:
# 1 грам мазнини = 9 калории
# 1 грам протеини = 4 калории
# 1 грам въглехидрати = 4 калории
# За да разберете колко калории дава един грам храна на котката, ще трябва да направите изчисления с реалното тегло на храната, тъй като тя съдържа вода. Трябва да се изчислят грамовете на мазнините, протеините и въглехидратите. Тяхната сума дава общото тегло на храната и от него трябва да извадим процентите вода.
# Вход:
# От конзолата се прочитат 5 реда:
# Процент на мазнините - цяло число в интервала [0…100]
# Процент на протеините - цяло число в интервала [0…100]
# Процент на въглехидратите - цяло число в интервала [0…100]
# Общ брой калории - цяло число в интервала [1000…15000]
# Процент на съдържанието на вода - цяло число в интервала [0…100]
# Пояснение: Когато правим подобни изчисления с проценти има голям шанс резултатът да не е цяло число!
# Изход:
# На конзолата се отпечатва 1 ред:
# "{calories}"
# Резултатът трябва да бъде форматиран до четвъртия знак след десетичната запетая.
#
# Вход
# 60
# 25
# 15
# 2500
# 60
# 40
# 40
# 20
# 3000
# 40
#
# Изход
# 2.4000

fat_per = int(input())
protein_per = int(input())
carbohydrate_per = int(input())
total_calories = int(input())
water_per = int(input())

total_fat_grams = total_calories * fat_per / 100 / 9
total_protein_grams = total_calories * protein_per / 100 / 4
total_carbohydrate_grams = total_calories * carbohydrate_per / 100 / 4

total_food_grams = total_fat_grams + total_protein_grams + total_carbohydrate_grams

calories_per_gram_food = total_calories / total_food_grams

calories_without_water = calories_per_gram_food - calories_per_gram_food * water_per / 100

print(f"{calories_without_water:.4f}")
