# Задача 3. Почивката на Дядо Коледа
# Всяка година Дядо Коледа избира различни дестинации за почивка. Тази година той решава да прекара почивните си дни в България. Неговите верни приятели – джуджетата, му предлагат да се настани в един от най-престижните хотели, а именно "Четири сезона". По време на престоя си там, той трябва да избере между следните видове помещения, със следните цени за престой:
# "room for one person" – 18.00 лв за нощувка
# "apartment" – 25.00 лв за нощувка
# "president apartment" – 35.00 лв за нощувка
# Според броят на дните, в които Дядо Коледа ще остане в хотела (пример: 11 дни = 10 нощувки) и видът на помещението, което ще избере, той може да ползва различно намаление. Намаленията спрямо дните и помещението са както следва:
# вид помещение	по-малко от 10 дни	между 10 и 15 дни	повече от 15 дни
# room for one person	не ползва намаление	не ползва намаление	не ползва намаление
# apartment	30% от крайната цена	35% от крайната цена	50% от крайната цена
# president apartment	10% от крайната цена	15% от крайната цена	20% от крайната цена
#
# След престоя си в хотела, оценката на Дядо Коледа за услугите на хотела може да е позитивна (positive) или негативна (negative). Ако оценката му е позитивна, към цената с вече приспаднатото намаление Дядо Коледа добавя 25%  към нея. Ако оценката му е негативна приспада от цената 10%.
# Вход
# Входът се чете от конзолата и се състои от три реда:
# Първи ред – дни за престой – цяло число в интервала [0...365]
# Втори ред –  вид помещение –  "room for one person",  "apartment" или "president apartment"
# Трети ред –  оценка - "positive"  или "negative"
# Изход
# На конзолата трябва да се отпечата един ред.
# Цената за престоят му в хотела, форматирана до втория знак след десетичната запетая
#
# Вход
# 14
# apartment
# positive
#
# Изход
# 264.06

stay_days = int(input())
login_type = input()
comment = input()

price = 0

if login_type == "room for one person":
    price = 18 * (stay_days-1)

elif login_type == "apartment":
    price = 25 * (stay_days - 1)
    if stay_days < 10:
        price -= price * 0.3
    elif 10<= stay_days <=15:
        price -= price * 0.35
    elif stay_days > 15:
        price -= price * 0.5

elif login_type == "president apartment":
    price = 35 * (stay_days - 1)
    if stay_days < 10:
        price -= price * 0.1
    elif 10<= stay_days <=15:
        price -= price * 0.15
    elif stay_days > 15:
        price -= price * 0.2

if comment == "positive":
    price += price * 0.25
elif comment == "negative":
    price -= price * 0.1

print(f"{price:.2f}")
