# Задача 6. Таблица за умножение
# Най-малкият син на семейство Иванови все още не знае таблицата за умножение. Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи. Вашата задача е да съставите програма, в която се въвежда цяло трицифрено число и се извежда таблицата за умножение. Поради особености на Вашата програма, тя взима цифрите на въведеното число в обратен ред. Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.
# Вход
# Входът е цяло трицифрено число в интервала [111…999].
# Изход
# Да се отпечатат на конзолата няколко на брой реда в следния формат:
# "{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"
# Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!
#
# Вход
# 324
#
# Изход
# 1 * 1 * 1 = 1;
# 1 * 1 * 2 = 2;
# 1 * 1 * 3 = 3;
# 1 * 2 * 1 = 2;
# 1 * 2 * 2 = 4;
# 1 * 2 * 3 = 6;
# 2 * 1 * 1 = 2;
# 2 * 1 * 2 = 4;
# 2 * 1 * 3 = 6;
# 2 * 2 * 1 = 4;
# 2 * 2 * 2 = 8;
# 2 * 2 * 3 = 12;
# 3 * 1 * 1 = 3;
# 3 * 1 * 2 = 6;
# 3 * 1 * 3 = 9;
# 3 * 2 * 1 = 6;
# 3 * 2 * 2 = 12;
# 3 * 2 * 3 = 18;
# 4 * 1 * 1 = 4;
# 4 * 1 * 2 = 8;
# 4 * 1 * 3 = 12;
# 4 * 2 * 1 = 8;
# 4 * 2 * 2 = 16;
# 4 * 2 * 3 = 24;

n = int(input())

n_text = str(n)
a1 = n_text[2]
a2 = n_text[1]
a3 = n_text[0]

for x1 in range(1, int(a1) + 1):
    for x2 in range(1, int(a2) + 1):
        for x3 in range(1, int(a3) + 1):
            print(f"{x1} * {x2} * {x3} = {x1 * x2 * x3};")
