# 4.Задължителна литература
# За лятната ваканция в списъка със задължителна литература на Жоро има определен брой книги. Понеже Жоро предпочита да играе с приятели навън, вашата задача е да му помогнете да изчисли колко часа на ден трябва да отделя, за да прочете необходимата литература.
# Вход
# От конзолата се четат 3 реда:
# 1.Брой страници в текущата книга – цяло число в интервала [1…1000]
# 2.Страници, които прочита за 1 час – цяло число в интервала [1…1000]
# 3.Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]
# Изход
# Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.
#
# Вход
# 212
# 20
# 2
#
# Изход
# 5

book_pages = int(input())
read_pages_per_hour = int(input())
days_to_finish_book = int(input())

total_hours_to_read_book = book_pages // read_pages_per_hour
hours_read_per_day = total_hours_to_read_book // days_to_finish_book

print(hours_read_per_day)
