# 6.Сграда
# Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:
# На всеки четен етаж има само офиси;
# На всеки нечетен етаж има само апартаменти;
# Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0;
# Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0;
# На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
# От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.
#
# Вход
# 6
# 4
#
# Изход
# L60 L61 L62 L63
# A50 A51 A52 A53
# O40 O41 O42 O43
# A30 A31 A32 A33
# O20 O21 O22 O23
# A10 A11 A12 A13

floors = int(input())
rooms = int(input())

for f in range(floors, 0, -1):
    for r in range(rooms):
        if f == floors:
            floor_letter = "L"
            print(f"{floor_letter}{f}{r}", end = " ")
        else:
            if f % 2 == 0:
                floor_letter = "O"
                print(f"{floor_letter}{f}{r}", end = " ")
            else:
                floor_letter = "A"
                print(f"{floor_letter}{f}{r}", end = " ")
    print()
