# 5.Специални числа
# Да се напише програма, която чете едно цяло число N, въведено от потребителя, и генерира всички възможни "специални" числа от 1111 до 9999. За да бъде “специално” едно число, то трябва да отговаря на следното условие:
# N да се дели на всяка една от неговите цифри без остатък.
# Пример: при N = 16, 2418 е специално число:
# 16 / 2 = 8 без остатък
# 16 / 4 = 4 без остатък
# 16 / 1 = 16 без остатък
# 16 / 8 = 2 без остатък
# Вход
# Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000]
# Изход
# На конзолата трябва да се отпечатат всички “специални” числа, разделени с интервал
#
# вход
# 3
#
# изход
# 1111 1113 1131 1133 1311 1313 1331 1333 3111 3113 3131 3133 3311 3313 3331 3333

n = int(input())

for number in range(1111, 9999 + 1):
    is_special_number = True
    for digit in str(number):
        if int(digit) == 0 or n % int(digit) != 0:
            is_special_number = False
            break
    if is_special_number:
        print(number, end = " ")
