# 4.Обръщение според възраст и пол
# Да се напише конзолна програма, която прочита възраст (реално число) и пол ('m' или 'f'), въведени от потребителя, и отпечатва обръщение измежду следните:
# "Mr." – мъж (пол 'm') на 16 или повече години
# "Master" – момче (пол 'm') под 16 години
# "Ms." – жена (пол 'f') на 16 или повече години
# "Miss" – момиче (пол 'f') под 16 години
#
# вход
# 12
# f
#
# изход
# Miss

age = float(input())
gender = input()

if gender == 'm':
    if age >= 16:
        print('Mr.')
    else:
        print('Master')
else:
    if age >= 16:
        print('Ms.')
    else:
        print('Miss')
