# 2.Бонус точки
# Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу. Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
# Ако числото е до 100 включително, бонус точките са 5;
# Ако числото е по-голямо от 100, бонус точките са 20% от числото;
# Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
#
# Допълнителни бонус точки (начисляват се отделно от предходните):
# oЗа четно число  + 1 т.
# oЗа число, което завършва на 5  + 2 т.
#
# вход
# 20
#
# изход
# 6
# 26

number = int(input())
bonus = 0

if number <=100:
    bonus = 5
elif number <= 1000:
    bonus = number * 0.2
else:
    bonus = number * 0.1

if number % 2 == 0:
    bonus = bonus + 1

if number % 10 == 5:
    bonus = bonus + 2

print(bonus)
print(bonus + number)
