# 6.Световен рекорд по плуване
# Иван решава да подобри Световния рекорд по плуване на дълги разстояния. На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри,  разстоянието в метри, което трябва да преплува и времето в секунди, за което плува разстояние от 1 м. Да се напише програма, която изчислява дали се е справил със задачата, като се има предвид, че: съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди. Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата, резултатът трябва да се закръгли надолу до най-близкото цяло число.
# Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо Световния рекорд.
# Вход
# От конзолата се четат 3 реда:
# 1.Рекордът в секунди – реално число;
# 2.Разстоянието в метри – реално число;
# 3.Времето в секунди, за което плува разстояние от 1 м. - реално число.
# Изход
# Отпечатването на конзолата зависи от резултата:
# Ако Иван е подобрил Световния рекорд (времето му е по-малко от рекорда) отпечатваме:
# o" Yes, he succeeded! The new world record is {времето на Иван} seconds."
# Ако НЕ е подобрил рекорда (времето му е по-голямо или равно на рекорда) отпечатваме:
# o"No, he failed! He was {недостигащите секунди} seconds slower."
# Резултатът трябва да се форматира до втория знак след десетичната запетая.
#
# Вход
# 10464
# 1500
# 20
#
# Изход
# No, he failed! He was 20786.00 seconds slower.

from math import floor

swim_record = float(input())
swim_distance = float(input())
swim_time_per_meter_in_seconds = float(input())

swim_time = swim_distance * swim_time_per_meter_in_seconds
resistance_added_time = floor(swim_distance / 15) * 12.5

swim_total_time = swim_time + resistance_added_time

if swim_total_time < swim_record:
    print(f"Yes, he succeeded! The new world record is {swim_total_time:.2f} seconds.")
else:
    print(f"No, he failed! He was {(swim_total_time - swim_record):.2f} seconds slower.")
