# 8. Световна ранглиста по тенис
# Григор Димитров е тенисист, чиято следваща цел е изкачването в световната ранглиста по тенис за мъже.
# През годината Гришо участва в определен брой турнири, като за всеки турнир получава точки, които зависят от позицията, на която е завършил в турнира. Има три варианта за завършване на турнир:
# W - ако е победител получава 2000 точки
# F - ако е финалист получава 1200 точки
# SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от турнирите е спечелил.
# Вход
# От конзолата първо се четат два реда:
# Брой турнири, в които е участвал – цяло число в интервала [1…20]
# Начален брой точки в ранглистата - цяло число в интервала [1...4000]
# За всеки турнир се прочита отделен ред:
# Достигнат етап от турнира – текст – "W", "F" или "SF"
# Изход
# Отпечатват се три реда в следния формат:
# "Final points: {брой точки след изиграните турнири}"
# "Average points: {средно колко точки печели за турнир}"
# "{процент спечелени турнири}%"
# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра след десетичния знак.
#
# Вход
# 5
# 1400
# F
# SF
# W
# W
# SF
#
# Изход
# Final points: 8040
# Average points: 1328 40.00%

from math import floor

tournament_number = int(input())
starting_points = int(input())

total_points = starting_points
w_tournament = 0

for i in range(1, tournament_number +1):
    tournament_stage = input()
    if tournament_stage == "W":
        total_points += 2000
        w_tournament += 1
    elif tournament_stage == "F":
        total_points += 1200
    elif tournament_stage == "SF":
        total_points += 720

print(f"Final points: {total_points}")
print(f"Average points: {floor((total_points - starting_points) / tournament_number)}")
print(f"{(w_tournament / tournament_number * 100):.2f}%")
