# 4.Номер
# Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас за създаването на новата им система за генериране на специални автомобилни номера. Всеки един специален автомобилен номер се състой от четири числа. Условията, които разграничават специалните от обикновените номера са следните:
# Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,  завършва на четна
# Първата цифра от номера е по-голяма от последната
# Сумата от втората и третата цифра трябва да е четно число
# Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
# Вход
# 1.Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
# 2.Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
# Изход
# На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.
#
# Вход
# 2
# 3
#
# Изход
# 3222 3332

first_digit = int(input())
last_digit = int(input())

is_even_odd = False
is_first_greater_than_last = False
is_sum_even = False

for a in range(first_digit, last_digit +1):
    for b in range(first_digit, last_digit +1):
        for c in range(first_digit, last_digit +1):
            for d in range(first_digit, last_digit +1):
                if a % 2 == 0 and d % 2 != 0:
                    is_even_odd = True
                if a % 2 != 0 and d % 2 == 0:
                    is_even_odd = True
                if a > d:
                    is_first_greater_than_last = True
                if (b + c) % 2 == 0:
                    is_sum_even = True
                if is_even_odd == True and is_first_greater_than_last == True and is_sum_even == True:
                    print(f"{a}{b}{c}{d}", end = " ")
                is_even_odd = False
                is_first_greater_than_last = False
                is_sum_even = False
