# 7.Генератор за сигурни пароли
# Ани се страхува от това, да не й бъде хакнат някой от профилите в социалните мрежи, затова решава да направи генератор за пароли, които да бъдат достатъчно сигурни. Вашата задача е да й помогнете да напише програма, която ще генерира тези пароли, разделени една от друга от знака "|".
# Да се напише програма, която генерира серия от символи като в шаблона:
# ABxyBA
# като при всяко генериране на нов код, стойностите на символите се увеличават с 1. Ако A надхвърли 55, се връща на 35. Ако B надхвърли 96, се връща на 64.
# Вход
# От конзолата се чете 1 ред:
# На първия ред a – цяло число в интервала [1 … 1000]
# На втория ред b – цяло число в интервала [1 … 1000]
# На третия ред максимален брой генерирани пароли – цяло число в интервала [1 … 1000000]
# Ограничения:
# A е символ с ASCII стойност в диапазона [35… 55]
# B е символ с ASCII стойност в диапазона [64 … 96]
# x e цяло число в диапазона [1… a]
# y e цяло число в диапазона [1… b]
# Изход:
# Да се отпечата на конзолата:
# Генерираният код. Ако броят на комбинациите е по-голям от максималния на кода, да се отпечата до подадената стойност, в противен случай да се отпечата до текущия брой на комбинациите.
#
# Вход
# 2
# 3
# 10
#
# Изход
# #@11@#|$A12A$|%B13B%|&C21C&|'D22D'|(E23E(|

a = int(input())
b = int(input())
max_password_count = int(input())

pa = 35
pb = 64

pass_count = 0
pass_exceeded = False

for x in range(1, a+1):
    for y in range(1, b+1):
        print(f"{chr(pa)}{chr(pb)}{x}{y}{chr(pb)}{chr(pa)}|", end = "")
        pass_count += 1
        pa += 1
        pb += 1
        if pa > 55:
            pa = 35
        if pb > 96:
            pb = 64
        if pass_count >= max_password_count:
            pass_exceeded = True
            break
    if pass_exceeded:
        break
